app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
    def index
        render json: Recipe.all, include: 'user', status: :created

INSERT INTO "recipes" ("user_id", "title", "instructions", "minutes_to_complete", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        recipe = Recipe.create!(title: params[:title], instructions: params[:instructions], minutes_to_complete: params[:minutes_to_complete], user_id: session[:user_id])